results/io_high_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      125.88
    writes/s:                     83.76
    fsyncs/s:                     360.60

Throughput:
    read, MiB/s:                  1.97
    written, MiB/s:               1.31

General statistics:
    total time:                          10.4924s
    total number of events:              4960

Latency (ms):
         min:                                    0.00
         avg:                                   16.17
         max:                                  652.93
         95th percentile:                       82.96
         sum:                                80207.22

Threads fairness:
    events (avg/stddev):           620.0000/52.75
    execution time (avg/stddev):   10.0259/0.01