results/io_high_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      52.98
    writes/s:                     35.02
    fsyncs/s:                     197.40

Throughput:
    read, MiB/s:                  0.83
    written, MiB/s:               0.55

General statistics:
    total time:                          11.0222s
    total number of events:              2122

Latency (ms):
         min:                                    0.00
         avg:                                   37.87
         max:                                  758.56
         95th percentile:                      123.28
         sum:                                80356.24

Threads fairness:
    events (avg/stddev):           265.2500/13.21
    execution time (avg/stddev):   10.0445/0.04


time taken - 16187.73828125