results/io_high_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      58.55
    writes/s:                     38.84
    fsyncs/s:                     215.13

Throughput:
    read, MiB/s:                  0.91
    written, MiB/s:               0.61

General statistics:
    total time:                          10.7085s
    total number of events:              2323

Latency (ms):
         min:                                    0.00
         avg:                                   34.59
         max:                                 1260.26
         95th percentile:                      104.84
         sum:                                80342.95

Threads fairness:
    events (avg/stddev):           290.3750/26.86
    execution time (avg/stddev):   10.0429/0.03


time taken - 40127.66943359375