results/io_high_seqrewr.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     554.59
    fsyncs/s:                     806.40

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               8.67

General statistics:
    total time:                          10.2764s
    total number of events:              12964

Latency (ms):
         min:                                    0.01
         avg:                                    6.28
         max:                                  819.28
         95th percentile:                       28.67
         sum:                                81450.25

Threads fairness:
    events (avg/stddev):           1620.5000/137.41
    execution time (avg/stddev):   10.1813/0.00


time taken - 10636.4345703125