results/io_low_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      48.16
    writes/s:                     31.98
    fsyncs/s:                     118.32

Throughput:
    read, MiB/s:                  0.75
    written, MiB/s:               0.50

General statistics:
    total time:                          10.8166s
    total number of events:              1891

Latency (ms):
         min:                                    0.00
         avg:                                   10.58
         max:                                  468.49
         95th percentile:                       33.12
         sum:                                20011.48

Threads fairness:
    events (avg/stddev):           945.5000/17.50
    execution time (avg/stddev):   10.0057/0.00


time taken - 40133.20947265625