results/io_low_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      69.50
    writes/s:                     46.33
    fsyncs/s:                     168.93

Throughput:
    read, MiB/s:                  1.09
    written, MiB/s:               0.72

General statistics:
    total time:                          10.3584s
    total number of events:              2694

Latency (ms):
         min:                                    0.00
         avg:                                    7.47
         max:                                  889.12
         95th percentile:                       29.72
         sum:                                20114.01

Threads fairness:
    events (avg/stddev):           1347.0000/200.00
    execution time (avg/stddev):   10.0570/0.00