results/io_low_seqrewr.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     968.84
    fsyncs/s:                     1253.07

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               15.14

General statistics:
    total time:                          10.7330s
    total number of events:              23595

Latency (ms):
         min:                                    0.01
         avg:                                    0.91
         max:                                  785.34
         95th percentile:                        0.09
         sum:                                21440.08

Threads fairness:
    events (avg/stddev):           11797.5000/779.50
    execution time (avg/stddev):   10.7200/0.00


time taken - 10854.6767578125