results/io_low_seqrewr.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     902.35
    fsyncs/s:                     1168.59

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               14.10

General statistics:
    total time:                          10.0832s
    total number of events:              20629

Latency (ms):
         min:                                    0.01
         avg:                                    0.98
         max:                                  635.81
         95th percentile:                        0.10
         sum:                                20137.57

Threads fairness:
    events (avg/stddev):           10314.5000/239.50
    execution time (avg/stddev):   10.0688/0.00


time taken - 40134.22802734375