results/io_medium_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      53.35
    writes/s:                     35.40
    fsyncs/s:                     162.51

Throughput:
    read, MiB/s:                  0.83
    written, MiB/s:               0.55

General statistics:
    total time:                          10.1394s
    total number of events:              2036

Latency (ms):
         min:                                    0.00
         avg:                                   19.65
         max:                                  555.08
         95th percentile:                       61.08
         sum:                                40000.67

Threads fairness:
    events (avg/stddev):           509.0000/15.73
    execution time (avg/stddev):   10.0002/0.00


time taken - 10683.72705078125