results/io_medium_rndrw.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      57.98
    writes/s:                     38.49
    fsyncs/s:                     169.49

Throughput:
    read, MiB/s:                  0.91
    written, MiB/s:               0.60

General statistics:
    total time:                          10.3648s
    total number of events:              2245

Latency (ms):
         min:                                    0.00
         avg:                                   17.87
         max:                                  502.27
         95th percentile:                       57.87
         sum:                                40109.94

Threads fairness:
    events (avg/stddev):           561.2500/14.82
    execution time (avg/stddev):   10.0275/0.01


time taken - 40127.9072265625