results/io_medium_seqrewr.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 16MiB each
2GiB total file size
Block size 16KiB
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing sequential rewrite test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     1168.93
    fsyncs/s:                     1541.69

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               18.26

General statistics:
    total time:                          10.0079s
    total number of events:              26619

Latency (ms):
         min:                                    0.01
         avg:                                    1.50
         max:                                  816.79
         95th percentile:                        0.08
         sum:                                39984.78

Threads fairness:
    events (avg/stddev):           6654.7500/452.50
    execution time (avg/stddev):   9.9962/0.00